{
 "cells": [
  {
   "cell_type": "code",
   "execution_count": 1,
   "metadata": {},
   "outputs": [],
   "source": [
    "from neo4j import GraphDatabase, basic_auth, Driver\n",
    "import os\n",
    "from dotenv import load_dotenv\n",
    "import pandas as pd\n",
    "from scipy.stats import pearsonr\n",
    "import networkx as nx\n",
    "import multiprocessing as mp\n",
    "import matplotlib.pyplot as plt\n",
    "import numpy as np"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 2,
   "metadata": {},
   "outputs": [],
   "source": [
    "load_dotenv()\n",
    "DB_HOST = os.getenv(\"NEO4J_HOST\")\n",
    "DB_PORT = os.getenv(\"NEO4J_PORT\")\n",
    "DB_USER = os.getenv(\"NEO4J_USER\")\n",
    "DB_PASS = os.getenv(\"NEO4J_PASS\")"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 3,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "<neo4j._sync.driver.BoltDriver at 0x7d20ea1dc770>"
      ]
     },
     "execution_count": 3,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "driver = GraphDatabase.driver(f\"bolt://{DB_HOST}:{DB_PORT}\", auth=basic_auth(DB_USER, DB_PASS))\n",
    "driver"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 4,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Found 512749 artists\n"
     ]
    }
   ],
   "source": [
    "with driver.session() as session:\n",
    "    query = \"\"\"\n",
    "        MATCH (n:Artist {in_last_fm: true})-[:COLLAB_WITH]->()\n",
    "        WITH DISTINCT(n)\n",
    "        RETURN n.main_id AS main_id, n.popularity_scaled as popularity_scaled\n",
    "    \"\"\"\n",
    "    q_result = session.run(query)\n",
    "    df = pd.DataFrame(q_result.data())\n",
    "\n",
    "df.sort_values(by=\"popularity_scaled\", inplace=True)\n",
    "df.reset_index(drop=True, inplace=True)\n",
    "\n",
    "print(f\"Found {len(df)} artists\")"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 5,
   "metadata": {},
   "outputs": [],
   "source": [
    "G = nx.Graph()\n",
    "# Nodes\n",
    "with driver.session() as session:\n",
    "    query = \"MATCH (n:Artist {in_last_fm:true}) RETURN n.main_id as main_id;\"\n",
    "    records = session.run(query)\n",
    "    for artist in records:\n",
    "        G.add_node(artist[\"main_id\"])\n",
    "# Edges\n",
    "with driver.session() as session:\n",
    "    query = \"\"\"\n",
    "        MATCH (a:Artist {in_last_fm: true})-[r:COLLAB_WITH]->(b:Artist {in_last_fm: true})\n",
    "        WHERE a < b\n",
    "        RETURN a.main_id as a, b.main_id as b, r.count as weight;\n",
    "    \"\"\"\n",
    "    records = session.run(query)\n",
    "    for rel in records:\n",
    "        a, b, w = rel[\"a\"], rel[\"b\"], rel[\"weight\"]\n",
    "        G.add_edge(a, b, weight=float(w))"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 6,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Computing for 0.0\n",
      "Computing for 0.5\n",
      "Computing for 1.0\n",
      "Computing for 1.5\n",
      "Computing for 2.0\n",
      "Computing for 2.5\n",
      "Computing for 3.0\n",
      "Computing for 3.5\n",
      "Computing for 4.0\n",
      "Computing for 4.5\n",
      "Computing for 5.0\n",
      "Computing for 5.5\n",
      "Computing for 6.0\n",
      "Computing for 6.5\n",
      "Computing for 7.0\n",
      "Computing for 7.5\n",
      "Computing for 8.0\n",
      "Computing for 8.5\n",
      "Computing for 9.0\n",
      "Computing for 9.5\n",
      "Computing for 10.0\n",
      "Computing for 10.5\n",
      "Computing for 11.0\n",
      "Computing for 11.5\n",
      "Computing for 12.0\n",
      "Computing for 12.5\n",
      "Computing for 13.0\n",
      "Computing for 13.5\n",
      "Computing for 14.0\n",
      "Computing for 14.5\n",
      "Computing for 15.0\n",
      "Computing for 15.5\n",
      "Computing for 16.0\n",
      "Computing for 16.5\n",
      "Computing for 17.0\n",
      "Computing for 17.5\n",
      "Computing for 18.0\n",
      "Computing for 18.5\n",
      "Computing for 19.0\n",
      "Computing for 19.5\n",
      "Computing for 20.0\n",
      "Computing for 20.5\n",
      "Computing for 21.0\n",
      "Computing for 21.5\n",
      "Computing for 22.0\n",
      "Computing for 22.5\n",
      "Computing for 23.0\n",
      "Computing for 23.5\n",
      "Computing for 24.0\n",
      "Computing for 24.5\n",
      "Computing for 25.0\n",
      "Computing for 25.5\n",
      "Computing for 26.0\n",
      "Computing for 26.5\n",
      "Computing for 27.0\n",
      "Computing for 27.5\n",
      "Computing for 28.0\n",
      "Computing for 28.5\n",
      "Computing for 29.0\n",
      "Computing for 29.5\n",
      "Computing for 30.0\n",
      "Computing for 30.5\n",
      "Computing for 31.0\n",
      "Computing for 31.5\n",
      "Computing for 32.0\n",
      "Computing for 32.5\n",
      "Computing for 33.0\n",
      "Computing for 33.5\n",
      "Computing for 34.0\n",
      "Computing for 34.5\n",
      "Computing for 35.0\n",
      "Computing for 35.5\n",
      "Computing for 36.0\n",
      "Computing for 36.5\n",
      "Computing for 37.0\n",
      "Computing for 37.5\n",
      "Computing for 38.0\n",
      "Computing for 38.5\n",
      "Computing for 39.0\n",
      "Computing for 39.5\n",
      "Computing for 40.0\n",
      "Computing for 40.5\n",
      "Computing for 41.0\n",
      "Computing for 41.5\n",
      "Computing for 42.0\n",
      "Computing for 42.5\n",
      "Computing for 43.0\n",
      "Computing for 43.5\n",
      "Computing for 44.0\n",
      "Computing for 44.5\n",
      "Computing for 45.0\n",
      "Computing for 45.5\n",
      "Computing for 46.0\n",
      "Computing for 46.5\n",
      "Computing for 47.0\n",
      "Computing for 47.5\n",
      "Computing for 48.0\n",
      "Computing for 48.5\n",
      "Computing for 49.0\n",
      "Computing for 49.5\n",
      "Computing for 50.0\n",
      "Computing for 50.5\n",
      "Computing for 51.0\n",
      "Computing for 51.5\n",
      "Computing for 52.0\n",
      "Computing for 52.5\n",
      "Computing for 53.0\n",
      "Computing for 53.5\n",
      "Computing for 54.0\n",
      "Computing for 54.5\n",
      "Computing for 55.0\n",
      "Computing for 55.5\n",
      "Computing for 56.0\n",
      "Computing for 56.5\n",
      "Computing for 57.0\n",
      "Computing for 57.5\n",
      "Computing for 58.0\n",
      "Computing for 58.5\n",
      "Computing for 59.0\n",
      "Computing for 59.5\n",
      "Computing for 60.0\n",
      "Computing for 60.5\n",
      "Computing for 61.0\n",
      "Computing for 61.5\n",
      "Computing for 62.0\n",
      "Computing for 62.5\n",
      "Computing for 63.0\n",
      "Computing for 63.5\n",
      "Computing for 64.0\n",
      "Computing for 64.5\n",
      "Computing for 65.0\n",
      "Computing for 65.5\n",
      "Computing for 66.0\n",
      "Computing for 66.5\n",
      "Computing for 67.0\n",
      "Computing for 67.5\n",
      "Computing for 68.0\n",
      "Computing for 68.5\n",
      "Computing for 69.0\n",
      "Computing for 69.5\n",
      "Computing for 70.0\n",
      "Computing for 70.5\n",
      "Computing for 71.0\n",
      "Computing for 71.5\n",
      "Computing for 72.0\n",
      "Computing for 72.5\n",
      "Computing for 73.0\n",
      "Computing for 73.5\n",
      "Computing for 74.0\n",
      "Computing for 74.5\n",
      "Computing for 75.0\n",
      "Computing for 75.5\n",
      "Computing for 76.0\n",
      "Computing for 76.5\n",
      "Computing for 77.0\n",
      "Computing for 77.5\n",
      "Computing for 78.0\n",
      "Computing for 78.5\n",
      "Computing for 79.0\n",
      "Computing for 79.5\n",
      "Computing for 80.0\n",
      "Computing for 80.5\n",
      "Computing for 81.0\n",
      "Computing for 81.5\n",
      "Computing for 82.0\n",
      "Computing for 82.5\n",
      "Computing for 83.0\n",
      "Computing for 83.5\n",
      "Computing for 84.0\n",
      "Computing for 84.5\n",
      "Computing for 85.0\n",
      "Computing for 85.5\n",
      "Computing for 86.0\n",
      "Computing for 86.5\n",
      "Computing for 87.0\n",
      "Computing for 87.5\n",
      "Computing for 88.0\n",
      "Computing for 88.5\n",
      "Computing for 89.0\n",
      "Computing for 89.5\n",
      "Computing for 90.0\n",
      "Computing for 90.5\n",
      "Computing for 91.0\n",
      "Computing for 91.5\n",
      "Computing for 92.0\n",
      "Computing for 92.5\n",
      "Computing for 93.0\n",
      "Computing for 93.5\n",
      "Computing for 94.0\n",
      "Computing for 94.5\n",
      "Computing for 95.0\n",
      "Computing for 95.5\n",
      "Computing for 96.0\n",
      "Computing for 96.5\n",
      "Computing for 97.0\n",
      "Computing for 97.5\n",
      "Computing for 98.0\n",
      "Computing for 98.5\n",
      "Computing for 99.0\n",
      "Computing for 99.5\n"
     ]
    }
   ],
   "source": [
    "df_len = len(df)\n",
    "params = list()\n",
    "x_axis = np.arange(0.0, 100.0, 0.5)\n",
    "for start_p in x_axis:\n",
    "    print(\"Computing for\", start_p)\n",
    "\n",
    "    start_i = int(start_p / 100.0 * df_len)\n",
    "    subdf = df.loc[start_i:df_len].copy()\n",
    "    subdf = subdf.reset_index()\n",
    "\n",
    "    subg = G.subgraph(subdf.main_id)\n",
    "\n",
    "    params.append([start_p, subdf, subg])"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 7,
   "metadata": {},
   "outputs": [],
   "source": [
    "def apply_custom_cumsum(df: pd.DataFrame) -> None:\n",
    "    i = 0\n",
    "    current_cum_sum = 0\n",
    "    while i < len(df) - 1:\n",
    "        if df.loc[i, \"pagerank\"] != df.loc[i + 1, \"pagerank\"]:\n",
    "            current_cum_sum += df.loc[i, \"pagerank\"]\n",
    "            df.loc[i, \"pagerank_acc\"] = current_cum_sum\n",
    "            i += 1\n",
    "        else:\n",
    "            j = i + 1\n",
    "            current_cum_sum += df.loc[i, \"pagerank\"]\n",
    "            while df.loc[j, \"pagerank\"] == df.loc[i, \"pagerank\"] and  j < len(df) - 1:\n",
    "                current_cum_sum += df.loc[j, \"pagerank\"]\n",
    "                j += 1\n",
    "            for k in range(i, j):\n",
    "                df.loc[k, \"pagerank_acc\"] = current_cum_sum\n",
    "            i = j\n",
    "    df.loc[i, \"pagerank_acc\"] = current_cum_sum + df.loc[i, \"pagerank\"]\n",
    "\n",
    "def task(p:float, df: pd.DataFrame, G: nx.Graph) -> tuple[float, float, float]:\n",
    "    print(\"Started task for\", p)\n",
    "    print(\"DF length:\", len(df))\n",
    "\n",
    "    pg = nx.pagerank(G)\n",
    "    df[\"pagerank\"] = df[\"main_id\"].map(pg)\n",
    "    df[\"pagerank_cumsum\"] = df['pagerank'].cumsum()\n",
    "    df[\"pagerank_acc\"] = df['pagerank_cumsum']  # Need a placeholder\n",
    "    apply_custom_cumsum(df)\n",
    "\n",
    "    pop_pg, p_pop_pg = pearsonr(df[\"popularity_scaled\"], df[\"pagerank\"])\n",
    "    if p_pop_pg >= 0.05:\n",
    "        print(\"Found conflicting p-value for PageRank:\", p_pop_pg)\n",
    "\n",
    "    pop_pg_cs, p_pop_pg_cs = pearsonr(df[\"popularity_scaled\"], df[\"pagerank_cumsum\"])\n",
    "    if p_pop_pg_cs >= 0.05:\n",
    "        print(\"Found conflicting p-value for PageRank_CumSum:\", p_pop_pg)\n",
    "\n",
    "    pop_pg_acc, p_pop_pg_acc = pearsonr(df[\"popularity_scaled\"], df[\"pagerank_acc\"])\n",
    "    if p_pop_pg_acc >= 0.05:\n",
    "        print(\"Found conflicting p-value for PageRankAcc:\", p_pop_pg)\n",
    "\n",
    "    print(\"Ended task for\", p)\n",
    "\n",
    "    return pop_pg, pop_pg_cs, pop_pg_acc"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 8,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Started task for 0.0\n",
      "DF length: 512749\n",
      "Started task for 5.0\n",
      "DF length: 487112\n",
      "Started task for 10.0\n",
      "DF length: 461475\n",
      "Started task for 15.0\n",
      "DF length: 435837\n",
      "Started task for 20.0\n",
      "DF length: 410200\n",
      "Found conflicting p-value for PageRank: 0.0\n",
      "Found conflicting p-value for PageRank_CumSum: 0.0\n",
      "Found conflicting p-value for PageRankAcc: 0.0\n",
      "Ended task for 5.0\n",
      "Started task for 5.5\n",
      "DF length: 484548\n",
      "Found conflicting p-value for PageRank: 0.0\n",
      "Found conflicting p-value for PageRank_CumSum: 0.0\n",
      "Found conflicting p-value for PageRankAcc: 0.0\n",
      "Ended task for 15.0\n",
      "Started task for 15.5\n",
      "DF length: 433273\n",
      "Found conflicting p-value for PageRank: 0.0\n",
      "Found conflicting p-value for PageRank_CumSum: 0.0\n",
      "Found conflicting p-value for PageRankAcc: 0.0\n",
      "Ended task for 10.0\n",
      "Started task for 10.5\n",
      "DF length: 458911\n",
      "Found conflicting p-value for PageRank: 0.0\n",
      "Found conflicting p-value for PageRank_CumSum: 0.0\n",
      "Found conflicting p-value for PageRankAcc: 0.0\n",
      "Ended task for 20.0\n",
      "Started task for 20.5\n",
      "DF length: 407636\n",
      "Found conflicting p-value for PageRank: 0.0\n",
      "Found conflicting p-value for PageRank_CumSum: 0.0\n",
      "Found conflicting p-value for PageRankAcc: 0.0\n",
      "Ended task for 0.0\n",
      "Started task for 0.5\n",
      "DF length: 510186\n"
     ]
    },
    {
     "ename": "KeyboardInterrupt",
     "evalue": "",
     "output_type": "error",
     "traceback": [
      "\u001b[0;31m---------------------------------------------------------------------------\u001b[0m",
      "\u001b[0;31mKeyboardInterrupt\u001b[0m                         Traceback (most recent call last)",
      "Cell \u001b[0;32mIn[8], line 3\u001b[0m\n\u001b[1;32m      1\u001b[0m num_workers \u001b[38;5;241m=\u001b[39m \u001b[38;5;241m5\u001b[39m\n\u001b[1;32m      2\u001b[0m \u001b[38;5;28;01mwith\u001b[39;00m mp\u001b[38;5;241m.\u001b[39mPool(num_workers) \u001b[38;5;28;01mas\u001b[39;00m pool:\n\u001b[0;32m----> 3\u001b[0m     results \u001b[38;5;241m=\u001b[39m \u001b[43mpool\u001b[49m\u001b[38;5;241;43m.\u001b[39;49m\u001b[43mstarmap\u001b[49m\u001b[43m(\u001b[49m\u001b[43mtask\u001b[49m\u001b[43m,\u001b[49m\u001b[43m \u001b[49m\u001b[43mparams\u001b[49m\u001b[43m)\u001b[49m\n",
      "File \u001b[0;32m~/miniforge3/envs/musicbrainz/lib/python3.12/multiprocessing/pool.py:375\u001b[0m, in \u001b[0;36mPool.starmap\u001b[0;34m(self, func, iterable, chunksize)\u001b[0m\n\u001b[1;32m    369\u001b[0m \u001b[38;5;28;01mdef\u001b[39;00m \u001b[38;5;21mstarmap\u001b[39m(\u001b[38;5;28mself\u001b[39m, func, iterable, chunksize\u001b[38;5;241m=\u001b[39m\u001b[38;5;28;01mNone\u001b[39;00m):\n\u001b[1;32m    370\u001b[0m \u001b[38;5;250m    \u001b[39m\u001b[38;5;124;03m'''\u001b[39;00m\n\u001b[1;32m    371\u001b[0m \u001b[38;5;124;03m    Like `map()` method but the elements of the `iterable` are expected to\u001b[39;00m\n\u001b[1;32m    372\u001b[0m \u001b[38;5;124;03m    be iterables as well and will be unpacked as arguments. Hence\u001b[39;00m\n\u001b[1;32m    373\u001b[0m \u001b[38;5;124;03m    `func` and (a, b) becomes func(a, b).\u001b[39;00m\n\u001b[1;32m    374\u001b[0m \u001b[38;5;124;03m    '''\u001b[39;00m\n\u001b[0;32m--> 375\u001b[0m     \u001b[38;5;28;01mreturn\u001b[39;00m \u001b[38;5;28;43mself\u001b[39;49m\u001b[38;5;241;43m.\u001b[39;49m\u001b[43m_map_async\u001b[49m\u001b[43m(\u001b[49m\u001b[43mfunc\u001b[49m\u001b[43m,\u001b[49m\u001b[43m \u001b[49m\u001b[43miterable\u001b[49m\u001b[43m,\u001b[49m\u001b[43m \u001b[49m\u001b[43mstarmapstar\u001b[49m\u001b[43m,\u001b[49m\u001b[43m \u001b[49m\u001b[43mchunksize\u001b[49m\u001b[43m)\u001b[49m\u001b[38;5;241;43m.\u001b[39;49m\u001b[43mget\u001b[49m\u001b[43m(\u001b[49m\u001b[43m)\u001b[49m\n",
      "File \u001b[0;32m~/miniforge3/envs/musicbrainz/lib/python3.12/multiprocessing/pool.py:768\u001b[0m, in \u001b[0;36mApplyResult.get\u001b[0;34m(self, timeout)\u001b[0m\n\u001b[1;32m    767\u001b[0m \u001b[38;5;28;01mdef\u001b[39;00m \u001b[38;5;21mget\u001b[39m(\u001b[38;5;28mself\u001b[39m, timeout\u001b[38;5;241m=\u001b[39m\u001b[38;5;28;01mNone\u001b[39;00m):\n\u001b[0;32m--> 768\u001b[0m     \u001b[38;5;28;43mself\u001b[39;49m\u001b[38;5;241;43m.\u001b[39;49m\u001b[43mwait\u001b[49m\u001b[43m(\u001b[49m\u001b[43mtimeout\u001b[49m\u001b[43m)\u001b[49m\n\u001b[1;32m    769\u001b[0m     \u001b[38;5;28;01mif\u001b[39;00m \u001b[38;5;129;01mnot\u001b[39;00m \u001b[38;5;28mself\u001b[39m\u001b[38;5;241m.\u001b[39mready():\n\u001b[1;32m    770\u001b[0m         \u001b[38;5;28;01mraise\u001b[39;00m \u001b[38;5;167;01mTimeoutError\u001b[39;00m\n",
      "File \u001b[0;32m~/miniforge3/envs/musicbrainz/lib/python3.12/multiprocessing/pool.py:765\u001b[0m, in \u001b[0;36mApplyResult.wait\u001b[0;34m(self, timeout)\u001b[0m\n\u001b[1;32m    764\u001b[0m \u001b[38;5;28;01mdef\u001b[39;00m \u001b[38;5;21mwait\u001b[39m(\u001b[38;5;28mself\u001b[39m, timeout\u001b[38;5;241m=\u001b[39m\u001b[38;5;28;01mNone\u001b[39;00m):\n\u001b[0;32m--> 765\u001b[0m     \u001b[38;5;28;43mself\u001b[39;49m\u001b[38;5;241;43m.\u001b[39;49m\u001b[43m_event\u001b[49m\u001b[38;5;241;43m.\u001b[39;49m\u001b[43mwait\u001b[49m\u001b[43m(\u001b[49m\u001b[43mtimeout\u001b[49m\u001b[43m)\u001b[49m\n",
      "File \u001b[0;32m~/miniforge3/envs/musicbrainz/lib/python3.12/threading.py:655\u001b[0m, in \u001b[0;36mEvent.wait\u001b[0;34m(self, timeout)\u001b[0m\n\u001b[1;32m    653\u001b[0m signaled \u001b[38;5;241m=\u001b[39m \u001b[38;5;28mself\u001b[39m\u001b[38;5;241m.\u001b[39m_flag\n\u001b[1;32m    654\u001b[0m \u001b[38;5;28;01mif\u001b[39;00m \u001b[38;5;129;01mnot\u001b[39;00m signaled:\n\u001b[0;32m--> 655\u001b[0m     signaled \u001b[38;5;241m=\u001b[39m \u001b[38;5;28;43mself\u001b[39;49m\u001b[38;5;241;43m.\u001b[39;49m\u001b[43m_cond\u001b[49m\u001b[38;5;241;43m.\u001b[39;49m\u001b[43mwait\u001b[49m\u001b[43m(\u001b[49m\u001b[43mtimeout\u001b[49m\u001b[43m)\u001b[49m\n\u001b[1;32m    656\u001b[0m \u001b[38;5;28;01mreturn\u001b[39;00m signaled\n",
      "File \u001b[0;32m~/miniforge3/envs/musicbrainz/lib/python3.12/threading.py:355\u001b[0m, in \u001b[0;36mCondition.wait\u001b[0;34m(self, timeout)\u001b[0m\n\u001b[1;32m    353\u001b[0m \u001b[38;5;28;01mtry\u001b[39;00m:    \u001b[38;5;66;03m# restore state no matter what (e.g., KeyboardInterrupt)\u001b[39;00m\n\u001b[1;32m    354\u001b[0m     \u001b[38;5;28;01mif\u001b[39;00m timeout \u001b[38;5;129;01mis\u001b[39;00m \u001b[38;5;28;01mNone\u001b[39;00m:\n\u001b[0;32m--> 355\u001b[0m         \u001b[43mwaiter\u001b[49m\u001b[38;5;241;43m.\u001b[39;49m\u001b[43macquire\u001b[49m\u001b[43m(\u001b[49m\u001b[43m)\u001b[49m\n\u001b[1;32m    356\u001b[0m         gotit \u001b[38;5;241m=\u001b[39m \u001b[38;5;28;01mTrue\u001b[39;00m\n\u001b[1;32m    357\u001b[0m     \u001b[38;5;28;01melse\u001b[39;00m:\n",
      "\u001b[0;31mKeyboardInterrupt\u001b[0m: "
     ]
    }
   ],
   "source": [
    "num_workers = 5\n",
    "with mp.Pool(num_workers) as pool:\n",
    "    results = pool.starmap(task, params)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 13,
   "metadata": {},
   "outputs": [
    {
     "ename": "NameError",
     "evalue": "name 'results' is not defined",
     "output_type": "error",
     "traceback": [
      "\u001b[0;31m---------------------------------------------------------------------------\u001b[0m",
      "\u001b[0;31mNameError\u001b[0m                                 Traceback (most recent call last)",
      "Cell \u001b[0;32mIn[13], line 1\u001b[0m\n\u001b[0;32m----> 1\u001b[0m normal \u001b[38;5;241m=\u001b[39m [result[\u001b[38;5;241m0\u001b[39m] \u001b[38;5;28;01mfor\u001b[39;00m result \u001b[38;5;129;01min\u001b[39;00m \u001b[43mresults\u001b[49m]\n\u001b[1;32m      2\u001b[0m cumsum \u001b[38;5;241m=\u001b[39m [result[\u001b[38;5;241m1\u001b[39m] \u001b[38;5;28;01mfor\u001b[39;00m result \u001b[38;5;129;01min\u001b[39;00m results]\n\u001b[1;32m      3\u001b[0m acc \u001b[38;5;241m=\u001b[39m [result[\u001b[38;5;241m2\u001b[39m] \u001b[38;5;28;01mfor\u001b[39;00m result \u001b[38;5;129;01min\u001b[39;00m results]\n",
      "\u001b[0;31mNameError\u001b[0m: name 'results' is not defined"
     ]
    }
   ],
   "source": [
    "normal = [result[0] for result in results]\n",
    "cumsum = [result[1] for result in results]\n",
    "acc = [result[2] for result in results]"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {},
   "outputs": [],
   "source": [
    "plt.plot(x_axis, normal, label=\"Normal PageRank correlation with popularity\")\n",
    "plt.plot(x_axis, cumsum, label=\"CumSum PageRank correlation with popularity\")\n",
    "plt.plot(x_axis, acc, label=\"Acc PageRank correlation with popularity\")\n",
    "\n",
    "plt.title(\"Correlation PageRank - Popularity\")\n",
    "plt.xaxis(\"Starting percentile\")\n",
    "plt.yaxis(\"Correlation value\")\n",
    "\n",
    "plt.show()"
   ]
  }
 ],
 "metadata": {
  "kernelspec": {
   "display_name": "musicbrainz",
   "language": "python",
   "name": "python3"
  },
  "language_info": {
   "codemirror_mode": {
    "name": "ipython",
    "version": 3
   },
   "file_extension": ".py",
   "mimetype": "text/x-python",
   "name": "python",
   "nbconvert_exporter": "python",
   "pygments_lexer": "ipython3",
   "version": "3.12.7"
  }
 },
 "nbformat": 4,
 "nbformat_minor": 2
}
